In [18]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [19]:
from pathlib import Path
import sys
BASE_DIR = Path.cwd().parent
sys.path.append(str(BASE_DIR))
from config import RAW_DATA, MODEL_DIR
df = pd.read_csv(RAW_DATA)

In [20]:
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10

In [21]:
df.shape

(395, 33)

In [22]:
# Xem kiểu dữ liệu và số lượng giá trị
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 33 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   school      395 non-null    object
 1   sex         395 non-null    object
 2   age         395 non-null    int64
 3   address     395 non-null    object
 4   famsize     395 non-null    object
 5   Pstatus     395 non-null    object
 6   Medu        395 non-null    int64
 7   Fedu        395 non-null    int64
 8   Mjob        395 non-null    object
 9   Fjob        395 non-null    object
 10  reason      395 non-null    object
 11  guardian    395 non-null    object
 12  traveltime  395 non-null    int64
 13  studytime   395 non-null    int64
 14  failures    395 non-null    int64
 15  schoolsup   395 non-null    object
 16  famsup      395 non-null    object
 17  paid        395 non-null    object
 18  activities  395 non-null    object
 19  nursery     395 non-null    object
 20  higher      395 non-null    object
 21  internet    395 non-null    object
 22  romantic    395 non-null    object
 23  famrel      395 non-null    int64
 24  freetime    395 non-null    int64
 25  goout       395 non-null    int64
 26  Dalc        395 non-null    int64
 27  Walc        395 non-null    int64
 28  health      395 non-null    int64
 29  absences    395 non-null    int64
 30  G1          395 non-null    int64
 31  G2          395 non-null    int64
 32  G3          395 non-null    int64
dtypes: int64(16), object(17)
memory usage: 102.0+ KB

In [23]:
columns_to_drop = ['address', 'famsize', 'Medu','Fedu','Mjob', 'Fjob','reason', 'guardian','traveltime', 'schoolsup', 'famsup', 'nursery','internet', 'Dalc', 'Walc']

df = df.drop(columns=columns_to_drop)

In [24]:
df.shape

(395, 18)

In [25]:
# Tổng số ô missing trong toàn bộ DataFrame
df.isna().sum().sum()

np.int64(0)

In [26]:
# Kiểm tra lại cho chắc
print(f"Tổng số ô missing: {df.isna().sum().sum()}")
print(f"Có missing nào không: {df.isna().any().any()}")

Tổng số ô missing: 0
Có missing nào không: False

In [27]:
# Kiểm tra số lượng hàng trùng lặp
df.duplicated().sum()

np.int64(0)

In [28]:
# Tạo cột mới 'G1_10'
df['G1_10'] = df['G1'] / 2

# 2. Chuyển đổi G2 từ thang 20 về thang 10
# Tạo cột mới 'G2_10'
df['G2_10'] = df['G2'] / 2

df['G3_10'] = df['G3'] / 2

# 3. Hiển thị kết quả kiểm tra
print(df[['G1', 'G1_10', 'G2', 'G2_10', 'G3', 'G3_10']].head())

   G1  G1_10  G2  G2_10  G3  G3_10
0   5    2.5   6    3.0   6    3.0
1   5    2.5   5    2.5   6    3.0
2   7    3.5   8    4.0  10    5.0
3  15    7.5  14    7.0  15    7.5
4   6    3.0  10    5.0  10    5.0

In [29]:
df.describe()

,age,studytime,failures,famrel,freetime,goout,health,absences,G1,G2,G3,G1_10,G2_10,G3_10
count,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000,395.000000
mean,16.696203,2.035443,0.334177,3.944304,3.235443,3.108861,3.554430,5.708861,10.908861,10.713924,10.415190,5.454430,5.356962,5.207595
std,1.276043,0.839240,0.743651,0.896659,0.998862,1.113278,1.390303,8.003096,3.319195,3.761505,4.581443,1.659597,1.880752,2.290721
min,15.000000,1.000000,0.000000,1.000000,1.000000,1.000000,1.000000,0.000000,3.000000,0.000000,0.000000,1.500000,0.000000,0.000000
25%,16.000000,1.000000,0.000000,4.000000,3.000000,2.000000,3.000000,0.000000,8.000000,9.000000,8.000000,4.000000,4.500000,4.000000
50%,17.000000,2.000000,0.000000,4.000000,3.000000,3.000000,4.000000,4.000000,11.000000,11.000000,11.000000,5.500000,5.500000,5.500000
75%,18.000000,2.000000,0.000000,5.000000,4.000000,4.000000,5.000000,8.000000,13.000000,13.000000,14.000000,6.500000,6.500000,7.000000
max,22.000000,4.000000,3.000000,5.000000,5.000000,5.000000,5.000000,75.000000,19.000000,19.000000,20.000000,9.500000,9.500000,10.000000

In [30]:
df.describe(include="object").columns

Index(['school', 'sex', 'Pstatus', 'paid', 'activities', 'higher', 'romantic'], dtype='object')

In [31]:
df.describe(include=['int64', 'float64']).columns

Index(['age', 'studytime', 'failures', 'famrel', 'freetime', 'goout', 'health',
       'absences', 'G1', 'G2', 'G3', 'G1_10', 'G2_10', 'G3_10'],
      dtype='object')

In [32]:
categorical_cols= ['sex', 'Pstatus', 'paid', 'activities', 'higher', 'romantic']
for col in categorical_cols:
    print(f"Value counts for {col}: \n {df[col].value_counts()}")

Value counts for sex:
 sex
F    208
M    187
Name: count, dtype: int64
Value counts for Pstatus:
 Pstatus
T    354
A     41
Name: count, dtype: int64
Value counts for paid:
 paid
no     214
yes    181
Name: count, dtype: int64
Value counts for activities:
 activities
yes    201
no     194
Name: count, dtype: int64
Value counts for higher:
 higher
yes    375
no      20
Name: count, dtype: int64
Value counts for romantic:
 romantic
no     263
yes    132
Name: count, dtype: int64